CREATE TABLE `admins` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(50) NOT NULL,
  `password` varchar(255) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

INSERT INTO `admins` VALUES
(1,'admin-mySYK','$2a$10$cHXnZvuzF0z0a8K47bp.retOCxoAVE76YK9pCjGcWDdavcxlgkfY.');


CREATE TABLE `blog_posts` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `content` mediumtext DEFAULT NULL,
  `images` mediumtext DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;


INSERT INTO `blog_posts` VALUES
(1,'လျှပ် စစ် တာဝါ တိုင် မှု များ။','လယ် ယာ မြေ၊ လူ နေ အိမ်ယာ မြေ၊ ပြည် သူတစ် ဦးဦး အသုံး ပြု နေ သော မြေ ပေါ် မှာ လျှပ် စစ် ဓာတ် အား လိုင်း များ သွယ် တန်း ခြင်း၊ ဓာတ် တိုင် များ တည် ဆောက် ခြင်း၊ လျှပ် စစ် တာဝါ တိုင် များ စိုက် ထူ ခြင်း၊ ထရန် စဖော် များ တည် ဆောက် ခြင်း အတွက် အစိုးရ ကသော် လည်းကောင်း၊ ပုဂ္ဂလိက သော် လည်း ကောင်း ဆောင် ရွက် ရာမှာ မြေ ကို တည် ဆဲ ဥပဒေ အရ သာ ရ ယူ ခွင့် ရှိပါ တယ်။\n \nလျှပ် စစ် သွယ် တန်း မှု များ နဲ့ ပတ် သက် လို့ မြေ အ ကွာ အဝေး သတ် မှတ် ချက် မှာ\n(၁) ၅ဝဝ ကေဗွီ ဓာတ် အား လိုင်း သည် ဗဟို မှ တစ် ဖက် တစ် ချက် သို့ ပေ ၁၀၀ စီ၊ စုစုပေါင်း ပေ ၂၀၀၊(၂) ၂၃၀ ကေဗွီဓာတ်အားလိုင်းသည် ဗဟိုမှတစ်ဖက်တစ်ချက်သို့ ၇၅ ပေစီဖြင့် စုစုပေါင်း ပေ ၁၅၀၊(၃) ၁၃၂ ကေဗွီဓာတ်အားလိုင်းသည် ဗဟိုမှတစ်ဖက်တစ်ချက်သို့ ၇၅ ပေစီဖြင့် စုစုပေါင်း ပေ ၁၅၀၊(၄) ၆၆ ကေဗွီဓာတ်အားလိုင်းသည် ဗဟိုမှ တစ်ဖက်တစ်ချက်သို့ ပေ ၃၀ စီဖြင့် စုစုပေါင်း ပေ ၆၀၊(၅) ၃၃ ကေဗွီဓာတ်အားလိုင်းသည် ဗဟိုမှ တစ်ဖက်တစ်ချက်သို့ ၁၀ ပေစီဖြင့် စုစုပေါင်း ပေ ၂၀၊\nအနိမ့်ဆုံးသွယ်တန်းမှုဖြစ်တဲ့ ကျေးရွာမီးလင်းရေး လုပ်ငန်းတွေမှာတောင် သတ်မှတ်ချက်တွေရှိပါတယ်။ ဓာတ်အားလိုင်းတစ်လျှောက်နဲ့ ဓာတ်တိုင်ပတ်ဝန်းကျင် သတ်မှတ်အကွာအဝေးများ အတိုင်း သစ်ပင်ခြုံနွယ်များကို အပြောင်ရှင်းရမည်-\n(က) 11 kV လိုင်းတွင် ဗဟိုမှ လက်ဝဲ ၁၀ ပေ လင်္ကျာဘက် ၁၀ ပေ စုစုပေါင်း ၂၀ ပေ အပြောင်ရှင်းရန်။(ခ) 400 V လိုင်းတွင် ဗဟိုမှ လက်ဝဲ ၅ ပေ လင်္ကျာဘက် ၅ ပေ စုစုပေါင်း ၁၀ ပေ အပြောင်ရှင်းရန်လို့ သတ်မှတ်ထားပါတယ်။လျှပ်စစ်သံလိုက်လှိုင်းများရဲ့ သတ်မှတ်ဧရိယာအတွင်း လူ၊ တိရစ္ဆာန်နှင့် သဘာဝပတ်ဝန်းကျင်ကို ထိခိုက်ခြင်း မရှိအောင်၊ ထိခိုက်မှု အနည်းဆုံးဖြစ်အောင်၊ အန္တရာယ်ကင်းရှင်းအောင် ပေအကွာအဝေးနဲ့ နယ်မြေသတ်မှတ်ပြီး လူနေထိုင်ခြင်း၊ စိုက်ပျိုးခြင်းနှင့် အခြားသုံးစွဲခြင်းများကို တားမြစ်ထားပါတယ်။ ဒီလို ပေအကွာအဝေး သတ်မှတ်ထားတဲ့အတွက် မြေအသုံးပြုနေသူက သူ့မြေဆုံးရှုံးမှုရှိသလို သတ်မှတ်ဧရိယာမှာ ဝင်ရောက်အသုံးပြုခဲ့ရင်လည်း အန္တရာယ်ဖြစ်ခြင်း၊ အရေးယူခံရခြင်း ရှိနိုင်ပါတယ်။\nလျှပ်စစ်ဥပဒေ ပုဒ်မ ၁၀ မှာ ဝန်ကြီးဌာန၊ သက်ဆိုင်ရာတိုင်းဒေသကြီး သို့မဟုတ် ပြည်နယ်အစိုးရအဖွဲ့နှင့် သက်ဆိုင်ရာကိုယ်ပိုင် အုပ်ချုပ်ခွင့်ရတိုင်း သို့မဟုတ် ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရဒေသဦးစီးအဖွဲ့များသည် လျှပ်စစ်ဆိုင်ရာလုပ်ငန်းများကို လုပ်ကိုင် ဆောင်ရွက်ရာတွင်-(က) အသုံးပြုရန် လိုအပ်သော မြေပမာဏကို တည်ဆဲဥပဒေများနှင့်အညီ ရယူအသုံးပြုခွင့် ရှိသည်။ (တည်ဆဲဥပဒေများအရ မြေကိုရယူ အသုံးပြုရမည်လို့ ဆိုပါတယ်။)\n(ခ) ပတ်ဝန်းကျင်ထိန်းသိမ်းရေးဥပဒေနှင့်အညီ ပတ်ဝန်းကျင်နှင့် လူမှုစီးပွားဝန်းကျင် သက်ရောက်မှုတို့ကို ဆန်းစစ်ခြင်း၊ ထိခိုက်မှု အနည်းဆုံးနည်းလမ်းဖြင့် ဆောင်ရွက်ခြင်း၊ထိခိုက်မှုများအတွက် ပြန်လည်ပေးလျော်ခြင်းနှင့် ပတ်ဝန်းကျင်ထိန်းသိမ်း​ရေးရန်ပုံငွေ ထည့်ဝင်ခြင်းတို့ကို ဆောင်ရွက်ရမည်။ ယင်းအချက်များကို ပုဂ္ဂလိကလုပ်ငန်း လုပ်ကိုင်ခွင့်ရရှိသူများလည်း လိုက်နာစေရန် ဆောင်ရွက်ရမည်။\n(ဂ) လျှပ်စစ်ဓာတ်အားစနစ်အတွင်း တည်ဆောက်အသုံးပြုနေသော လျှပ်စစ်ဓာတ်အား ဖြန့်ဖြူးရေးနှင့် ပို့လွှတ်ရေးလိုင်းများ၊ ဓာတ်အားခွဲရုံများ၊ ဓာတ်အားပေးစက်ရုံများနှင့်ဆက်စပ်​အဆောက်အအုံများကို တည်ဆဲဥပဒေများနှင့်အညီ တိုးချဲ့ခြင်း၊ ပြုပြင်ခြင်းနှင့် ပြောင်းရွှေ့ တည်ဆောက်ခြင်းတို့ ဆောင်ရွက်ခွင့်ရှိသည် လို့ပြဌာန်းထားပါတယ်။\nဒီလျှပ်စစ်ဥပဒေအရ မြေကို ရယူအသုံးပြုခွင့်ရှိတာ မှန်ပေမယ့် တည်ဆဲဥပဒေများနှင့်အညီ၊ ပတ်ဝန်းကျင်ထိန်းသိမ်းရေး ဥပဒေနှင့်အညီသာ ဖြစ်ရပါမယ်။ အများပြည်သူအကျိုးအတွက် နိုင်ငံတော်စီမံကိန်းဖြစ်ရင်လည်း ပြည်သူတစ်ဦးတစ်ယောက် အသုံးပြုနေတဲ့ မြေဖြစ်တဲ့အတွက် ပြည်သူက မြေကို ကြည်ဖြူစွာ စွန့်လွှတ်ပေးကမ်းခြင်း၊ ညှိနှိုင်းပြေလည်ခြင်းမျိုး တစ်ခုခုတော့ ရှိရပါမယ်။ ဒီလိုမှ မဟုတ်ဘူးဆိုရင်တော့ တည်ဆဲဥပဒေအရ မြေကိုရယူဆောင်ရွက်ရပါမယ်။\nတည်ဆဲဥပဒေလို့ဆိုတဲ့အတွက် မြေသိမ်းဥပဒေဖြစ်တဲ့ ၁၈၉၄ ခုနှစ်၊ မြေသိမ်းအက်ဥပဒေအရ ဆောင်ရွက်ရမှာ ဖြစ်ပါတယ်။ ဒီဥပဒေအရ မြေကို သိမ်းယူ လွှဲပြောင်းပြီးမှ အသုံးပြုရမှာ ဖြစ်ပါတယ်။ မြေသိမ်းဥပဒေရဲ့ ရည်ရွယ်ချက်ကို ကြည့်ရင် \"အများပြည်သူအတွက်ဖြစ်စေ၊ ကုမ္ပဏီအတွက်ဖြစ်စေ ရယူမည့် မြေများနှင့်စပ်လျဉ်း၍ ယင်းသို့ ရယူမှုအတွက် ပေးအပ်ရမည့် လျော်ကြေးကို သတ်မှတ်ပြဋ္ဌာန်းရန် လိုအပ်သည့်အတွက် ဥပဒေကို ပြဋ္ဌာန်းခြင်းဖြစ်သည်\" လို့ဆိုထားပါတယ်။\nနောက်တစ်ခါ ၁၈၉၄ ခုနှစ် မြေသိမ်းဥပဒေမှာ မြေနှင့်ပတ်သက်၍ အကျိုးစီးပွား သက်ဆိုင်သူ ဆိုတာကို ပုဒ်မ ၃(ခ)မှာ အကျိုးစီးပွား သက်ဆိုင်သူဆိုသည်မှာ ဤအက်ဥပဒေအရ မြေကို သိမ်းယူမှုအတွက် လျော်ကြေးငွေ တောင်းဆိုထိုက်သူစာရင်းတွင် ပါဝင်သူ အားလုံးကို ဆိုလိုသည်။ အကယ်၍ မြေနှင့် စပ်လျဉ်း၍ လူတစ်ဦး၏ အကျိုးစီးပွား ယုတ်လျော့မှုအတွက် ပတ်သက်သူဖြစ်လျှင် ထိုသူသည် ဤအက်ဥပဒေအရ မြေတွင် အကျိုးစီးပွား သက်ဆိုင်သူ ဖြစ်သည်လို့ ပြဌာန်းထားပါတယ်။ မြေသိမ်းဥပဒေအရ မြေကို ရယူခြင်းကြောင့် ပြည်သူတစ်ဦး တစ်ယောက်ရဲ့အကျိုးစီးပွား ထိခိုက်နစ်နာမှု မရှိစေရေးအတွက် သူအသုံးပြုနေတဲ့ မြေအတွက် သတ်မှတ်လျော်ကြေးငွေ ပေးအပ်ပြီးမှ ရယူသုံးစွဲရမှာ ဖြစ်ပါတယ်။\nအချို့သော ဒေသတွေမှာ နိုင်ငံတော်စီမံကိန်းမို့လို့၊ ဒေသဖွံ့ဖြိုးရေးမို့လို့၊ အများပြည်သူအတွက်မို့လို့ဆိုပြီး လျှပ်စစ်သွယ်တန်းရာလမ်းတလျောက်မြေတွေကို နစ်နာကြေး မပေးပဲ ဆောင်ရွက်နိုင်တယ်လို့ ပြောဆိုတာ၊ ယူဆတာတွေ ရှိနေပါတယ်။ ပုံစံ ၇ ရှိတဲ့ လယ်မြေပေါ် သွယ်တန်းသွားတာကို မြေပိုင်ရှင်က ပြောလဲ အရေးမစိုက်ပဲ ဆက်လုပ်သွားတယ် ဆိုတာတွေ ကြားသိရပါတယ်။ ​ပုံစံ ၇ လို လုပ်ပိုင်ခွင့်ရှိတဲ့သူက လယ်ယာမြေဥပဒေအရ ကျူးကျော်လုပ်ဆောင်သူကို တရားပြန်စွဲလို့တောင် ရပါတယ်။\nဒါကြောင့် ဒေသဖွံဖြိုးရေးအတွက် လျှပ်စစ်မီးက အရေးပါတဲ့လုပ်ငန်းဖြစ်သလို ဒီလုပ်ငန်းကြောင့် အချို့သောပြည်သူများ နစ်နာမှုမရှိအောင်လည်း ဥပဒေနဲ့အညီ လုပ်ဆောင်ကြရမှာ ဖြစ်ပါတယ်။ မြေကိုရယူရာမှာလည်း တည်ဆဲဥပဒေအရ ရယူအသုံးပြုရမှာ ဖြစ်တဲ့အတွက် မြေပိုင်ရှင် မဟုတ်ရင်တောင် မြေနဲ့ပတ်သက်လို့ အကျိုးခံစားခွင့်ရှိသူဖြစ်ရင် မြေသိမ်းဥပဒေအရ နစ်နာမှုအတွက် လျော်ကြေးခံစားခွင့်ပေးရမှာ ဖြစ်ပါကြောင်း တင်ပြလိုက်ပါတယ်။','/uploads/blog/1784374475_31d201a5ebed2509b013.jpg'),
(2,'Sample 1','This is s trial','/uploads/blog/1784293071_edcb5107d2a4eeff9e46.jpeg');


CREATE TABLE `properties` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `images` mediumtext DEFAULT NULL,
  `location` varchar(255) DEFAULT NULL,
  `size` varchar(255) DEFAULT NULL,
  `price` varchar(255) DEFAULT NULL,
  `rooms` varchar(255) DEFAULT NULL,
  `masterBedrooms` varchar(255) DEFAULT NULL,
  `bedrooms` varchar(255) DEFAULT NULL,
  `bathrooms` varchar(255) DEFAULT NULL,
  `description` mediumtext DEFAULT NULL,
  `facebookPost` mediumtext DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;


INSERT INTO `properties` VALUES
(2,'JSON Update Test','[\"\\/uploads\\/1784374496_f3e01c2e4da2083e9357.jpg\"]','from json','55','123','1','2','3','4','Sample d','null'),
(3,'G မြေ အရောင်း။','[\"\\/uploads\\/properties\\/1784380260_da7dcfedc0b1c866dcee.jpeg\"]','မိုင်တိုင် ၁၁၉ - ၁၂၀ ရန်ကုန်မန္တလေး အမြန်လမ်း။','180','120000','','','','','မိုင်တိုင် ၁၁၉ - ၁၂၀ ရန်ကုန်မန္တလေး အမြန်လမ်း။\r\n\r\nမြေအမျိုးအစား G (အမည်ပေါက်)\r\nမျက်နှာစာ ပေ ၁၈၀၀ (ဝန်းကျင်)\r\n\r\nအကျယ်အဝန်း ဧက ၁၈၀\r\nစျေးနှုန်း သိန်း ၁၂၀,၀၀၀ (ညှိနှိုင်း)','https://www.facebook.com/100057760475303/posts/1440764151192254/?app=fbl'),
(4,'Multipurpose Land','[\"\\/uploads\\/1784398498_e51695ba40dde9dce0df.jpg\"]','119 mile Yangon Mandalay Expressway','ဧက ၁၈၀','သိန်း ၁၂၀,၀၀၀','','','','','မိုင်တိုင် ၁၁၉ - ၁၂၀ ရန်ကုန်မန္တလေး အမြန်လမ်း။\r\n\r\nမြေအမျိုးအစား G (အမည်ပေါက်)\r\nမျက်နှာစာ ပေ ၁၈၀၀ (ဝန်းကျင်)\r\n\r\nအကျယ်အဝန်း ဧက ၁၈၀\r\nစျေးနှုန်း သိန်း ၁၂၀,၀၀၀ (ညှိနှိုင်း)','https://www.facebook.com/100057760475303/posts/1440764151192254/?app=fbl'),
(5,'Multipart Test',NULL,'From Multipart',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL);
